apache/nuttx/arch/arm/src/stm32c5/hardware/stm32c5xx_flash.h
/****************************************************************************
 * arch/arm/src/stm32c5/hardware/stm32c5xx_flash.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32C5_HARDWARE_STM32C5XX_FLASH_H
#define __ARCH_ARM_SRC_STM32C5_HARDWARE_STM32C5XX_FLASH_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "chip.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* FLASH geometry ***********************************************************/

#define STM32_FLASH_NPAGES              64
#define STM32_FLASH_PAGESIZE            8192

#define STM32_FLASH_SIZE \
  (STM32_FLASH_NPAGES * STM32_FLASH_PAGESIZE)

/* Register Offsets *********************************************************/

#define STM32_FLASH_ACR_OFFSET            0x0000
#define STM32_FLASH_KEYR_OFFSET           0x0004
#define STM32_FLASH_OPTKEYR_OFFSET        0x000c
#define STM32_FLASH_OPSR_OFFSET           0x0018
#define STM32_FLASH_OPTCR_OFFSET          0x001c
#define STM32_FLASH_SR_OFFSET             0x0020
#define STM32_FLASH_CR_OFFSET             0x0028
#define STM32_FLASH_CCR_OFFSET            0x0030
#define STM32_FLASH_PRIVCFGR_OFFSET       0x003c
#define STM32_FLASH_HDPEXTR_OFFSET        0x0048
#define STM32_FLASH_OPTSR_CUR_OFFSET      0x0050
#define STM32_FLASH_OPTSR_PRG_OFFSET      0x0054
#define STM32_FLASH_OPTSR2_CUR_OFFSET     0x0070
#define STM32_FLASH_OPTSR2_PRG_OFFSET     0x0074
#define STM32_FLASH_BOOTR_CUR_OFFSET      0x0080
#define STM32_FLASH_BOOTR_PRG_OFFSET      0x0084
#define STM32_FLASH_OTPBLR_CUR_OFFSET     0x0090
#define STM32_FLASH_OTPBLR_PRG_OFFSET     0x0094
#define STM32_FLASH_BL_COM_CFG_CUR_OFFSET 0x0098
#define STM32_FLASH_BL_COM_CFG_PRG_OFFSET 0x009c
#define STM32_FLASH_OEMKEYR1_PRG_OFFSET   0x00a4
#define STM32_FLASH_OEMKEYR2_PRG_OFFSET   0x00ac
#define STM32_FLASH_OEMKEYR3_PRG_OFFSET   0x00b4
#define STM32_FLASH_OEMKEYR4_PRG_OFFSET   0x00bc
#define STM32_FLASH_BSKEYR_PRG_OFFSET     0x00c4
#define STM32_FLASH_WRP1R_CUR_OFFSET      0x00e8
#define STM32_FLASH_WRP1R_PRG_OFFSET      0x00ec
#define STM32_FLASH_HDP1R_CUR_OFFSET      0x00f8
#define STM32_FLASH_HDP1R_PRG_OFFSET      0x00fc
#define STM32_FLASH_ECCCORR_OFFSET        0x0100
#define STM32_FLASH_ECCDETR_OFFSET        0x0104
#define STM32_FLASH_ECCDR_OFFSET          0x0108
#define STM32_FLASH_WRP2R_CUR_OFFSET      0x01e8
#define STM32_FLASH_WRP2R_PRG_OFFSET      0x01ec
#define STM32_FLASH_HDP2R_CUR_OFFSET      0x01f8
#define STM32_FLASH_HDP2R_PRG_OFFSET      0x01fc

/* Register Addresses *******************************************************/

#define STM32_FLASH_ACR            (STM32_FLASHIF_BASE + STM32_FLASH_ACR_OFFSET)
#define STM32_FLASH_KEYR           (STM32_FLASHIF_BASE + STM32_FLASH_KEYR_OFFSET)
#define STM32_FLASH_OPTKEYR        (STM32_FLASHIF_BASE + STM32_FLASH_OPTKEYR_OFFSET)
#define STM32_FLASH_OPSR           (STM32_FLASHIF_BASE + STM32_FLASH_OPSR_OFFSET)
#define STM32_FLASH_OPTCR          (STM32_FLASHIF_BASE + STM32_FLASH_OPTCR_OFFSET)
#define STM32_FLASH_SR             (STM32_FLASHIF_BASE + STM32_FLASH_SR_OFFSET)
#define STM32_FLASH_CR             (STM32_FLASHIF_BASE + STM32_FLASH_CR_OFFSET)
#define STM32_FLASH_CCR            (STM32_FLASHIF_BASE + STM32_FLASH_CCR_OFFSET)
#define STM32_FLASH_PRIVCFGR       (STM32_FLASHIF_BASE + STM32_FLASH_PRIVCFGR_OFFSET)
#define STM32_FLASH_HDPEXTR        (STM32_FLASHIF_BASE + STM32_FLASH_HDPEXTR_OFFSET)
#define STM32_FLASH_OPTSR_CUR      (STM32_FLASHIF_BASE + STM32_FLASH_OPTSR_CUR_OFFSET)
#define STM32_FLASH_OPTSR_PRG      (STM32_FLASHIF_BASE + STM32_FLASH_OPTSR_PRG_OFFSET)
#define STM32_FLASH_OPTSR2_CUR     (STM32_FLASHIF_BASE + STM32_FLASH_OPTSR2_CUR_OFFSET)
#define STM32_FLASH_OPTSR2_PRG     (STM32_FLASHIF_BASE + STM32_FLASH_OPTSR2_PRG_OFFSET)
#define STM32_FLASH_BOOTR_CUR      (STM32_FLASHIF_BASE + STM32_FLASH_BOOTR_CUR_OFFSET)
#define STM32_FLASH_BOOTR_PRG      (STM32_FLASHIF_BASE + STM32_FLASH_BOOTR_PRG_OFFSET)
#define STM32_FLASH_OTPBLR_CUR     (STM32_FLASHIF_BASE + STM32_FLASH_OTPBLR_CUR_OFFSET)
#define STM32_FLASH_OTPBLR_PRG     (STM32_FLASHIF_BASE + STM32_FLASH_OTPBLR_PRG_OFFSET)
#define STM32_FLASH_BL_COM_CFG_CUR (STM32_FLASHIF_BASE + STM32_FLASH_BL_COM_CFG_CUR_OFFSET)
#define STM32_FLASH_BL_COM_CFG_PRG (STM32_FLASHIF_BASE + STM32_FLASH_BL_COM_CFG_PRG_OFFSET)
#define STM32_FLASH_OEMKEYR1_PRG   (STM32_FLASHIF_BASE + STM32_FLASH_OEMKEYR1_PRG_OFFSET)
#define STM32_FLASH_OEMKEYR2_PRG   (STM32_FLASHIF_BASE + STM32_FLASH_OEMKEYR2_PRG_OFFSET)
#define STM32_FLASH_OEMKEYR3_PRG   (STM32_FLASHIF_BASE + STM32_FLASH_OEMKEYR3_PRG_OFFSET)
#define STM32_FLASH_OEMKEYR4_PRG   (STM32_FLASHIF_BASE + STM32_FLASH_OEMKEYR4_PRG_OFFSET)
#define STM32_FLASH_BSKEYR_PRG     (STM32_FLASHIF_BASE + STM32_FLASH_BSKEYR_PRG_OFFSET)
#define STM32_FLASH_WRP1R_CUR      (STM32_FLASHIF_BASE + STM32_FLASH_WRP1R_CUR_OFFSET)
#define STM32_FLASH_WRP1R_PRG      (STM32_FLASHIF_BASE + STM32_FLASH_WRP1R_PRG_OFFSET)
#define STM32_FLASH_HDP1R_CUR      (STM32_FLASHIF_BASE + STM32_FLASH_HDP1R_CUR_OFFSET)
#define STM32_FLASH_HDP1R_PRG      (STM32_FLASHIF_BASE + STM32_FLASH_HDP1R_PRG_OFFSET)
#define STM32_FLASH_ECCCORR        (STM32_FLASHIF_BASE + STM32_FLASH_ECCCORR_OFFSET)
#define STM32_FLASH_ECCDETR        (STM32_FLASHIF_BASE + STM32_FLASH_ECCDETR_OFFSET)
#define STM32_FLASH_ECCDR          (STM32_FLASHIF_BASE + STM32_FLASH_ECCDR_OFFSET)
#define STM32_FLASH_WRP2R_CUR      (STM32_FLASHIF_BASE + STM32_FLASH_WRP2R_CUR_OFFSET)
#define STM32_FLASH_WRP2R_PRG      (STM32_FLASHIF_BASE + STM32_FLASH_WRP2R_PRG_OFFSET)
#define STM32_FLASH_HDP2R_CUR      (STM32_FLASHIF_BASE + STM32_FLASH_HDP2R_CUR_OFFSET)
#define STM32_FLASH_HDP2R_PRG      (STM32_FLASHIF_BASE + STM32_FLASH_HDP2R_PRG_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* FLASH access control register */

