apache/nuttx/arch/arm/src/stm32c5/hardware/stm32c5xx_flash.h
#define FLASH_ACR_RESET                       0x00000027
#define FLASH_ACR_LATENCY_SHIFT               (0)
#define FLASH_ACR_LATENCY_MASK                (0xf << FLASH_ACR_LATENCY_SHIFT)
#define FLASH_ACR_LATENCY(n)                  ((n) << FLASH_ACR_LATENCY_SHIFT)
#define FLASH_ACR_LATENCY_0                 FLASH_ACR_LATENCY(0)
#define FLASH_ACR_LATENCY_1                 FLASH_ACR_LATENCY(1)
#define FLASH_ACR_LATENCY_2                 FLASH_ACR_LATENCY(2)
#define FLASH_ACR_LATENCY_3                 FLASH_ACR_LATENCY(3)
#define FLASH_ACR_LATENCY_4                 FLASH_ACR_LATENCY(4)
#define FLASH_ACR_LATENCY_5                 FLASH_ACR_LATENCY(5)
#define FLASH_ACR_LATENCY_6                 FLASH_ACR_LATENCY(6)
#define FLASH_ACR_LATENCY_7                 FLASH_ACR_LATENCY(7)
#define FLASH_ACR_LATENCY_8                 FLASH_ACR_LATENCY(8)
#define FLASH_ACR_LATENCY_9                 FLASH_ACR_LATENCY(9)
#define FLASH_ACR_LATENCY_10                FLASH_ACR_LATENCY(10)
#define FLASH_ACR_LATENCY_11                FLASH_ACR_LATENCY(11)
#define FLASH_ACR_LATENCY_12                FLASH_ACR_LATENCY(12)
#define FLASH_ACR_LATENCY_13                FLASH_ACR_LATENCY(13)
#define FLASH_ACR_LATENCY_14                FLASH_ACR_LATENCY(14)
#define FLASH_ACR_LATENCY_15                FLASH_ACR_LATENCY(15)
#define FLASH_ACR_WRHIGHFREQ_SHIFT            (4)
#define FLASH_ACR_WRHIGHFREQ_MASK             (0x3 << FLASH_ACR_WRHIGHFREQ_SHIFT)
#define FLASH_ACR_WRHIGHFREQ(n)               ((n) << FLASH_ACR_WRHIGHFREQ_SHIFT)
#define FLASH_ACR_WRHIGHFREQ_0              FLASH_ACR_WRHIGHFREQ(0)
#define FLASH_ACR_WRHIGHFREQ_1              FLASH_ACR_WRHIGHFREQ(1)
#define FLASH_ACR_WRHIGHFREQ_2              FLASH_ACR_WRHIGHFREQ(2)
#define FLASH_ACR_PRFTEN                      (1 << 8)
#define FLASH_ACR_EMPTY                       (1 << 16)

/* FLASH key register */

#define FLASH_KEYR_RESET                      0x00000000
#define FLASH_KEYR_KEY_SHIFT                  (0)
#define FLASH_KEYR_KEY_MASK                   (0xffffffff << FLASH_KEYR_KEY_SHIFT)
#define FLASH_KEYR_KEY(n)                     ((n) << FLASH_KEYR_KEY_SHIFT)
#define FLASH_KEYR_KEY1                     0x45670123
#define FLASH_KEYR_KEY2                     0xcdef89ab

/* FLASH option key register */

#define FLASH_OPTKEYR_RESET                   0x00000000
#define FLASH_OPTKEYR_OPTKEY_SHIFT            (0)
#define FLASH_OPTKEYR_OPTKEY_MASK             (0xffffffff << FLASH_OPTKEYR_OPTKEY_SHIFT)
#define FLASH_OPTKEYR_OPTKEY(n)               ((n) << FLASH_OPTKEYR_OPTKEY_SHIFT)
#define FLASH_OPTKEYR_OPTKEY1               0x08192a3b
#define FLASH_OPTKEYR_OPTKEY2               0x4c5d6e7f

/* FLASH operation status register */

#define FLASH_OPSR_RESET                      0x00000000
#define FLASH_OPSR_ADDR_OP_SHIFT              (0)
#define FLASH_OPSR_ADDR_OP_MASK               (0xffff << FLASH_OPSR_ADDR_OP_SHIFT)
#define FLASH_OPSR_ADDR_OP(n)                 ((n) << FLASH_OPSR_ADDR_OP_SHIFT)
#define FLASH_OPSR_DATA_OP                    (1 << 21)
#define FLASH_OPSR_BK_OP                      (1 << 22)
#define FLASH_OPSR_OTP_OP                     (1 << 24)
#define FLASH_OPSR_CODE_OP_SHIFT              (29)
#define FLASH_OPSR_CODE_OP_MASK               (0x7 << FLASH_OPSR_CODE_OP_SHIFT)
#define FLASH_OPSR_CODE_OP(n)                 ((n) << FLASH_OPSR_CODE_OP_SHIFT)
#define FLASH_OPSR_CODE_OP_NONE             FLASH_OPSR_CODE_OP(0)
#define FLASH_OPSR_CODE_OP_WRITE            FLASH_OPSR_CODE_OP(1)
#define FLASH_OPSR_CODE_OP_PAGE_ERASE       FLASH_OPSR_CODE_OP(3)
#define FLASH_OPSR_CODE_OP_BANK_ERASE       FLASH_OPSR_CODE_OP(4)
#define FLASH_OPSR_CODE_OP_MASS_ERASE       FLASH_OPSR_CODE_OP(5)
#define FLASH_OPSR_CODE_OP_OPTION_CHANGE    FLASH_OPSR_CODE_OP(6)

/* FLASH option control register */

#define FLASH_OPTCR_RESET                     0x00000001
#define FLASH_OPTCR_OPTLOCK                   (1 << 0)
#define FLASH_OPTCR_OPTSTRT                   (1 << 1)
#define FLASH_OPTCR_SWAP_BANK                 (1 << 31)

/* FLASH status register */

#define FLASH_SR_RESET                        0x00000000
#define FLASH_SR_BSY                          (1 << 0)
#define FLASH_SR_WBNE                         (1 << 1)
#define FLASH_SR_DBNE                         (1 << 3)
#define FLASH_SR_OEMLOCK                      (1 << 8)
#define FLASH_SR_BSLOCK                       (1 << 9)
#define FLASH_SR_EOP                          (1 << 16)
#define FLASH_SR_WRPERR                       (1 << 17)
#define FLASH_SR_PGSERR                       (1 << 18)
#define FLASH_SR_STRBERR                      (1 << 19)
#define FLASH_SR_INCERR                       (1 << 20)
#define FLASH_SR_OPTCHANGEERR                 (1 << 23)

/* FLASH control register */

#define FLASH_CR_RESET                        0x00000001
#define FLASH_CR_LOCK                         (1 << 0)
#define FLASH_CR_PG                           (1 << 1)
#define FLASH_CR_PER                          (1 << 2)
#define FLASH_CR_BER                          (1 << 3)
#define FLASH_CR_FW                           (1 << 4)
#define FLASH_CR_STRT                         (1 << 5)
#define FLASH_CR_PNB_SHIFT                    (6)
#define FLASH_CR_PNB_MASK                     (0x3f << FLASH_CR_PNB_SHIFT)
#define FLASH_CR_PNB(n)                       ((n) << FLASH_CR_PNB_SHIFT)
#define FLASH_CR_MER                          (1 << 15)
#define FLASH_CR_EOPIE                        (1 << 16)
#define FLASH_CR_WRPERRIE                     (1 << 17)
#define FLASH_CR_PGSERRIE                     (1 << 18)
#define FLASH_CR_STRBERRIE                    (1 << 19)
#define FLASH_CR_INCERRIE                     (1 << 20)
#define FLASH_CR_OPTCHANGEERRIE               (1 << 23)
#define FLASH_CR_EDATASEL                     (1 << 29)
#define FLASH_CR_BKSEL                        (1 << 31)

/* FLASH clear control register */

#define FLASH_CCR_RESET                       0x00000000
#define FLASH_CCR_CLR_EOP                     (1 << 16)
#define FLASH_CCR_CLR_WRPERR                  (1 << 17)
#define FLASH_CCR_CLR_PGSERR                  (1 << 18)
#define FLASH_CCR_CLR_STRBERR                 (1 << 19)
#define FLASH_CCR_CLR_INCERR                  (1 << 20)
#define FLASH_CCR_CLR_OPTCHANGEERR            (1 << 23)

/* FLASH privilege configuration register */

