apache/nuttx/arch/arm/src/stm32c5/hardware/stm32c5xx_flash.h
#define FLASH_PRIVCFGR_RESET                  0x00000000
#define FLASH_PRIVCFGR_PRIV                   (1 << 1)

/* FLASH HDP extension register */

#define FLASH_HDPEXTR_RESET                   0x00000000
#define FLASH_HDPEXTR_HDP1_EXT_SHIFT          (0)
#define FLASH_HDPEXTR_HDP1_EXT_MASK           (0x3f << FLASH_HDPEXTR_HDP1_EXT_SHIFT)
#define FLASH_HDPEXTR_HDP1_EXT(n)             ((n) << FLASH_HDPEXTR_HDP1_EXT_SHIFT)
#define FLASH_HDPEXTR_HDP2_EXT_SHIFT          (16)
#define FLASH_HDPEXTR_HDP2_EXT_MASK           (0x3f << FLASH_HDPEXTR_HDP2_EXT_SHIFT)
#define FLASH_HDPEXTR_HDP2_EXT(n)             ((n) << FLASH_HDPEXTR_HDP2_EXT_SHIFT)

/* FLASH option status register */

#define FLASH_OPTSR_CUR_RESET                 0x00000000
#define FLASH_OPTSR_CUR_IWDG_SW               (1 << 3)
#define FLASH_OPTSR_CUR_WWDG_SW               (1 << 4)
#define FLASH_OPTSR_CUR_NRST_STOP             (1 << 6)
#define FLASH_OPTSR_CUR_NRST_STDBY            (1 << 7)
#define FLASH_OPTSR_CUR_RDP_LEVEL_SHIFT       (8)
#define FLASH_OPTSR_CUR_RDP_LEVEL_MASK        (0xff << FLASH_OPTSR_CUR_RDP_LEVEL_SHIFT)
#define FLASH_OPTSR_CUR_RDP_LEVEL(n)          ((n) << FLASH_OPTSR_CUR_RDP_LEVEL_SHIFT)
#define FLASH_OPTSR_CUR_RDP_LEVEL_0         FLASH_OPTSR_CUR_RDP_LEVEL(0xed)
#define FLASH_OPTSR_CUR_RDP_LEVEL_2_WBS     FLASH_OPTSR_CUR_RDP_LEVEL(0xd1)
#define FLASH_OPTSR_CUR_RDP_LEVEL_2         FLASH_OPTSR_CUR_RDP_LEVEL(0x72)
#define FLASH_OPTSR_CUR_IWDG_STOP             (1 << 20)
#define FLASH_OPTSR_CUR_IWDG_STDBY            (1 << 21)
#define FLASH_OPTSR_CUR_BOOT_SEL              (1 << 22)
#define FLASH_OPTSR_CUR_BOOT0                 (1 << 23)
#define FLASH_OPTSR_CUR_EDATA_EN              (1 << 29)
#define FLASH_OPTSR_CUR_SINGLE_BANK           (1 << 30)
#define FLASH_OPTSR_CUR_SWAP_BANK             (1 << 31)

/* FLASH option status register */

#define FLASH_OPTSR_PRG_RESET                 0x00000000
#define FLASH_OPTSR_PRG_IWDG_SW               (1 << 3)
#define FLASH_OPTSR_PRG_WWDG_SW               (1 << 4)
#define FLASH_OPTSR_PRG_NRST_STOP             (1 << 6)
#define FLASH_OPTSR_PRG_NRST_STDBY            (1 << 7)
#define FLASH_OPTSR_PRG_RDP_LEVEL_SHIFT       (8)
#define FLASH_OPTSR_PRG_RDP_LEVEL_MASK        (0xff << FLASH_OPTSR_PRG_RDP_LEVEL_SHIFT)
#define FLASH_OPTSR_PRG_RDP_LEVEL(n)          ((n) << FLASH_OPTSR_PRG_RDP_LEVEL_SHIFT)
#define FLASH_OPTSR_PRG_RDP_LEVEL_0         FLASH_OPTSR_PRG_RDP_LEVEL(0xed)
#define FLASH_OPTSR_PRG_RDP_LEVEL_2_WBS     FLASH_OPTSR_PRG_RDP_LEVEL(0xd1)
#define FLASH_OPTSR_PRG_RDP_LEVEL_2         FLASH_OPTSR_PRG_RDP_LEVEL(0x72)
#define FLASH_OPTSR_PRG_IWDG_STOP             (1 << 20)
#define FLASH_OPTSR_PRG_IWDG_STDBY            (1 << 21)
#define FLASH_OPTSR_PRG_BOOT_SEL              (1 << 22)
#define FLASH_OPTSR_PRG_BOOT0                 (1 << 23)
#define FLASH_OPTSR_PRG_EDATA_EN              (1 << 29)
#define FLASH_OPTSR_PRG_SINGLE_BANK           (1 << 30)
#define FLASH_OPTSR_PRG_SWAP_BANK             (1 << 31)

/* FLASH option status register 2 */

#define FLASH_OPTSR2_CUR_RESET                0x00000000
#define FLASH_OPTSR2_CUR_SRAM1_RST            (1 << 0)
#define FLASH_OPTSR2_CUR_SRAM2_RST            (1 << 1)
#define FLASH_OPTSR2_CUR_SRAM2_ECC            (1 << 4)

/* FLASH option status register 2 */

#define FLASH_OPTSR2_PRG_RESET                0x00000000
#define FLASH_OPTSR2_PRG_SRAM1_RST            (1 << 0)
#define FLASH_OPTSR2_PRG_SRAM2_RST            (1 << 1)
#define FLASH_OPTSR2_PRG_SRAM2_ECC            (1 << 4)

/* FLASH unique boot entry register */

#define FLASH_BOOTR_CUR_RESET                 0x00000000
#define FLASH_BOOTR_CUR_BOOT_LOCK_SHIFT       (0)
#define FLASH_BOOTR_CUR_BOOT_LOCK_MASK        (0xff << FLASH_BOOTR_CUR_BOOT_LOCK_SHIFT)
#define FLASH_BOOTR_CUR_BOOT_LOCK(n)          ((n) << FLASH_BOOTR_CUR_BOOT_LOCK_SHIFT)
#define FLASH_BOOTR_CUR_BOOT_LOCK_MODIFIABLE \
  FLASH_BOOTR_CUR_BOOT_LOCK(0xc3)
#define FLASH_BOOTR_CUR_BOOT_LOCK_FROZEN \
  FLASH_BOOTR_CUR_BOOT_LOCK(0xb4)
#define FLASH_BOOTR_CUR_BOOTADD_SHIFT         (8)
#define FLASH_BOOTR_CUR_BOOTADD_MASK          (0xffffff << FLASH_BOOTR_CUR_BOOTADD_SHIFT)
#define FLASH_BOOTR_CUR_BOOTADD(n)            ((n) << FLASH_BOOTR_CUR_BOOTADD_SHIFT)

/* FLASH unique boot entry address */

#define FLASH_BOOTR_PRG_RESET                 0x00000000
#define FLASH_BOOTR_PRG_BOOT_LOCK_SHIFT       (0)
#define FLASH_BOOTR_PRG_BOOT_LOCK_MASK        (0xff << FLASH_BOOTR_PRG_BOOT_LOCK_SHIFT)
#define FLASH_BOOTR_PRG_BOOT_LOCK(n)          ((n) << FLASH_BOOTR_PRG_BOOT_LOCK_SHIFT)
#define FLASH_BOOTR_PRG_BOOT_LOCK_MODIFIABLE \
  FLASH_BOOTR_PRG_BOOT_LOCK(0xc3)
#define FLASH_BOOTR_PRG_BOOT_LOCK_FROZEN \
  FLASH_BOOTR_PRG_BOOT_LOCK(0xb4)
#define FLASH_BOOTR_PRG_BOOTADD_SHIFT         (8)
#define FLASH_BOOTR_PRG_BOOTADD_MASK          (0xffffff << FLASH_BOOTR_PRG_BOOTADD_SHIFT)
#define FLASH_BOOTR_PRG_BOOTADD(n)            ((n) << FLASH_BOOTR_PRG_BOOTADD_SHIFT)

/* FLASH OTP block lock */

#define FLASH_OTPBLR_CUR_RESET                0x00000000
#define FLASH_OTPBLR_CUR_LOCKBL_SHIFT         (0)
#define FLASH_OTPBLR_CUR_LOCKBL_MASK          (0xffffff << FLASH_OTPBLR_CUR_LOCKBL_SHIFT)
#define FLASH_OTPBLR_CUR_LOCKBL(n)            ((n) << FLASH_OTPBLR_CUR_LOCKBL_SHIFT)

/* FLASH OTP block lock */

#define FLASH_OTPBLR_PRG_RESET                0x00000000
#define FLASH_OTPBLR_PRG_LOCKBL_SHIFT         (0)
#define FLASH_OTPBLR_PRG_LOCKBL_MASK          (0xffffff << FLASH_OTPBLR_PRG_LOCKBL_SHIFT)
#define FLASH_OTPBLR_PRG_LOCKBL(n)            ((n) << FLASH_OTPBLR_PRG_LOCKBL_SHIFT)

/* FLASH bootloader interface selection */

#define FLASH_BL_COM_CFG_CUR_RESET            0x00000000
#define FLASH_BL_COM_CFG_CUR_BL_COM_CFG_SHIFT (0)
#define FLASH_BL_COM_CFG_CUR_BL_COM_CFG_MASK  (0xffffffff << FLASH_BL_COM_CFG_CUR_BL_COM_CFG_SHIFT)
#define FLASH_BL_COM_CFG_CUR_BL_COM_CFG(n)    ((n) << FLASH_BL_COM_CFG_CUR_BL_COM_CFG_SHIFT)

/* FLASH bootloader interface selection */

#define FLASH_BL_COM_CFG_PRG_RESET            0x00000000
#define FLASH_BL_COM_CFG_PRG_BL_COM_CFG_SHIFT (0)
#define FLASH_BL_COM_CFG_PRG_BL_COM_CFG_MASK  (0xffffffff << FLASH_BL_COM_CFG_PRG_BL_COM_CFG_SHIFT)
#define FLASH_BL_COM_CFG_PRG_BL_COM_CFG(n)    ((n) << FLASH_BL_COM_CFG_PRG_BL_COM_CFG_SHIFT)

/* FLASH OEM key register 1 */

#define FLASH_OEMKEYR1_PRG_RESET              0x00000000
#define FLASH_OEMKEYR1_PRG_OEMKEY_SHIFT       (0)
#define FLASH_OEMKEYR1_PRG_OEMKEY_MASK        (0xffffffff << FLASH_OEMKEYR1_PRG_OEMKEY_SHIFT)
#define FLASH_OEMKEYR1_PRG_OEMKEY(n)          ((n) << FLASH_OEMKEYR1_PRG_OEMKEY_SHIFT)

