apache/nuttx/arch/arm/src/stm32c5/hardware/stm32c5xx_flash.h
/* FLASH OEM key register 2 */

#define FLASH_OEMKEYR2_PRG_RESET              0x00000000
#define FLASH_OEMKEYR2_PRG_OEMKEY_SHIFT       (0)
#define FLASH_OEMKEYR2_PRG_OEMKEY_MASK        (0xffffffff << FLASH_OEMKEYR2_PRG_OEMKEY_SHIFT)
#define FLASH_OEMKEYR2_PRG_OEMKEY(n)          ((n) << FLASH_OEMKEYR2_PRG_OEMKEY_SHIFT)

/* FLASH OEM key register 3 */

#define FLASH_OEMKEYR3_PRG_RESET              0x00000000
#define FLASH_OEMKEYR3_PRG_OEMKEY_SHIFT       (0)
#define FLASH_OEMKEYR3_PRG_OEMKEY_MASK        (0xffffffff << FLASH_OEMKEYR3_PRG_OEMKEY_SHIFT)
#define FLASH_OEMKEYR3_PRG_OEMKEY(n)          ((n) << FLASH_OEMKEYR3_PRG_OEMKEY_SHIFT)

/* FLASH OEM key register 4 */

#define FLASH_OEMKEYR4_PRG_RESET              0x00000000
#define FLASH_OEMKEYR4_PRG_OEMKEY_SHIFT       (0)
#define FLASH_OEMKEYR4_PRG_OEMKEY_MASK        (0xffffffff << FLASH_OEMKEYR4_PRG_OEMKEY_SHIFT)
#define FLASH_OEMKEYR4_PRG_OEMKEY(n)          ((n) << FLASH_OEMKEYR4_PRG_OEMKEY_SHIFT)

/* FLASH boundary scan key register */

#define FLASH_BSKEYR_PRG_RESET                0x00000000
#define FLASH_BSKEYR_PRG_BSKEY_SHIFT          (0)
#define FLASH_BSKEYR_PRG_BSKEY_MASK           (0xffffffff << FLASH_BSKEYR_PRG_BSKEY_SHIFT)
#define FLASH_BSKEYR_PRG_BSKEY(n)             ((n) << FLASH_BSKEYR_PRG_BSKEY_SHIFT)

/* FLASH write page protection for bank1 */

#define FLASH_WRP1R_CUR_RESET                 0x00000000
#define FLASH_WRP1R_CUR_WRPSG1_SHIFT          (0)
#define FLASH_WRP1R_CUR_WRPSG1_MASK           (0xffffffff << FLASH_WRP1R_CUR_WRPSG1_SHIFT)
#define FLASH_WRP1R_CUR_WRPSG1(n)             ((n) << FLASH_WRP1R_CUR_WRPSG1_SHIFT)

/* FLASH write-page protection for bank1 */

#define FLASH_WRP1R_PRG_RESET                 0x00000000
#define FLASH_WRP1R_PRG_WRPSG1_SHIFT          (0)
#define FLASH_WRP1R_PRG_WRPSG1_MASK           (0xffffffff << FLASH_WRP1R_PRG_WRPSG1_SHIFT)
#define FLASH_WRP1R_PRG_WRPSG1(n)             ((n) << FLASH_WRP1R_PRG_WRPSG1_SHIFT)

/* FLASH HDP bank1 register */

#define FLASH_HDP1R_CUR_RESET                 0x00000000
#define FLASH_HDP1R_CUR_HDP1_STRT_SHIFT       (0)
#define FLASH_HDP1R_CUR_HDP1_STRT_MASK        (0x3f << FLASH_HDP1R_CUR_HDP1_STRT_SHIFT)
#define FLASH_HDP1R_CUR_HDP1_STRT(n)          ((n) << FLASH_HDP1R_CUR_HDP1_STRT_SHIFT)
#define FLASH_HDP1R_CUR_HDP1_END_SHIFT        (16)
#define FLASH_HDP1R_CUR_HDP1_END_MASK         (0x3f << FLASH_HDP1R_CUR_HDP1_END_SHIFT)
#define FLASH_HDP1R_CUR_HDP1_END(n)           ((n) << FLASH_HDP1R_CUR_HDP1_END_SHIFT)

/* FLASH HDP bank1 register */

#define FLASH_HDP1R_PRG_RESET                 0x00000000
#define FLASH_HDP1R_PRG_HDP1_STRT_SHIFT       (0)
#define FLASH_HDP1R_PRG_HDP1_STRT_MASK        (0x3f << FLASH_HDP1R_PRG_HDP1_STRT_SHIFT)
#define FLASH_HDP1R_PRG_HDP1_STRT(n)          ((n) << FLASH_HDP1R_PRG_HDP1_STRT_SHIFT)
#define FLASH_HDP1R_PRG_HDP1_END_SHIFT        (16)
#define FLASH_HDP1R_PRG_HDP1_END_MASK         (0x3f << FLASH_HDP1R_PRG_HDP1_END_SHIFT)
#define FLASH_HDP1R_PRG_HDP1_END(n)           ((n) << FLASH_HDP1R_PRG_HDP1_END_SHIFT)

/* FLASH ECC correction register */

#define FLASH_ECCCORR_RESET                   0x00000000
#define FLASH_ECCCORR_ADDR_ECC_SHIFT          (0)
#define FLASH_ECCCORR_ADDR_ECC_MASK           (0x3fff << FLASH_ECCCORR_ADDR_ECC_SHIFT)
#define FLASH_ECCCORR_ADDR_ECC(n)             ((n) << FLASH_ECCCORR_ADDR_ECC_SHIFT)
#define FLASH_ECCCORR_EDATA_ECC               (1 << 21)
#define FLASH_ECCCORR_BK_ECC                  (1 << 22)
#define FLASH_ECCCORR_SYSF_ECC                (1 << 23)
#define FLASH_ECCCORR_OTP_ECC                 (1 << 24)
#define FLASH_ECCCORR_ECCCIE                  (1 << 25)
#define FLASH_ECCCORR_ECCC                    (1 << 30)

/* FLASH ECC detection register */

#define FLASH_ECCDETR_RESET                   0x00000000
#define FLASH_ECCDETR_ADDR_ECC_SHIFT          (0)
#define FLASH_ECCDETR_ADDR_ECC_MASK           (0x3fff << FLASH_ECCDETR_ADDR_ECC_SHIFT)
#define FLASH_ECCDETR_ADDR_ECC(n)             ((n) << FLASH_ECCDETR_ADDR_ECC_SHIFT)
#define FLASH_ECCDETR_EDATA_ECC               (1 << 21)
#define FLASH_ECCDETR_BK_ECC                  (1 << 22)
#define FLASH_ECCDETR_SYSF_ECC                (1 << 23)
#define FLASH_ECCDETR_OTP_ECC                 (1 << 24)
#define FLASH_ECCDETR_ECCD                    (1 << 31)

/* FLASH ECC data */

#define FLASH_ECCDR_RESET                     0x00000000
#define FLASH_ECCDR_DATA_ECC_SHIFT            (0)
#define FLASH_ECCDR_DATA_ECC_MASK             (0xffff << FLASH_ECCDR_DATA_ECC_SHIFT)
#define FLASH_ECCDR_DATA_ECC(n)               ((n) << FLASH_ECCDR_DATA_ECC_SHIFT)
#define FLASH_ECCDR_DATA_ADDR_ECC_SHIFT       (16)
#define FLASH_ECCDR_DATA_ADDR_ECC_MASK        (0x7 << FLASH_ECCDR_DATA_ADDR_ECC_SHIFT)
#define FLASH_ECCDR_DATA_ADDR_ECC(n)          ((n) << FLASH_ECCDR_DATA_ADDR_ECC_SHIFT)

/* FLASH write page protection for bank2 */

#define FLASH_WRP2R_CUR_RESET                 0x00000000
#define FLASH_WRP2R_CUR_WRPSG2_SHIFT          (0)
#define FLASH_WRP2R_CUR_WRPSG2_MASK           (0xffffffff << FLASH_WRP2R_CUR_WRPSG2_SHIFT)
#define FLASH_WRP2R_CUR_WRPSG2(n)             ((n) << FLASH_WRP2R_CUR_WRPSG2_SHIFT)

/* FLASH write page protection for bank2 */

#define FLASH_WRP2R_PRG_RESET                 0x00000000
#define FLASH_WRP2R_PRG_WRPSG2_SHIFT          (0)
#define FLASH_WRP2R_PRG_WRPSG2_MASK           (0xffffffff << FLASH_WRP2R_PRG_WRPSG2_SHIFT)
#define FLASH_WRP2R_PRG_WRPSG2(n)             ((n) << FLASH_WRP2R_PRG_WRPSG2_SHIFT)

/* FLASH HDP bank2 register */

#define FLASH_HDP2R_CUR_RESET                 0x00000000
#define FLASH_HDP2R_CUR_HDP2_STRT_SHIFT       (0)
#define FLASH_HDP2R_CUR_HDP2_STRT_MASK        (0x3f << FLASH_HDP2R_CUR_HDP2_STRT_SHIFT)
#define FLASH_HDP2R_CUR_HDP2_STRT(n)          ((n) << FLASH_HDP2R_CUR_HDP2_STRT_SHIFT)
#define FLASH_HDP2R_CUR_HDP2_END_SHIFT        (16)
#define FLASH_HDP2R_CUR_HDP2_END_MASK         (0x3f << FLASH_HDP2R_CUR_HDP2_END_SHIFT)
#define FLASH_HDP2R_CUR_HDP2_END(n)           ((n) << FLASH_HDP2R_CUR_HDP2_END_SHIFT)

/* FLASH HDP bank2 register */

#define FLASH_HDP2R_PRG_RESET                 0x00000000
#define FLASH_HDP2R_PRG_HDP2_STRT_SHIFT       (0)
#define FLASH_HDP2R_PRG_HDP2_STRT_MASK        (0x3f << FLASH_HDP2R_PRG_HDP2_STRT_SHIFT)
#define FLASH_HDP2R_PRG_HDP2_STRT(n)          ((n) << FLASH_HDP2R_PRG_HDP2_STRT_SHIFT)
#define FLASH_HDP2R_PRG_HDP2_END_SHIFT        (16)
#define FLASH_HDP2R_PRG_HDP2_END_MASK         (0x3f << FLASH_HDP2R_PRG_HDP2_END_SHIFT)
#define FLASH_HDP2R_PRG_HDP2_END(n)           ((n) << FLASH_HDP2R_PRG_HDP2_END_SHIFT)
#endif /* __ARCH_ARM_SRC_STM32C5_HARDWARE_STM32C5XX_FLASH_H */
